[
  {
    "name": "War",
    "endpoint": "war",
    "type": "Card",
    "soloGame": true,
    "localMultiplayer": false,
    "iaAvailable": true,
    "icon": "war_icon.png",
    "minPlayer": 1,
    "maxPlayer": 1,
    "totalPlayerIncludingAI": 2,
    "rule": "The goal is to be the first player to win 100 points.<br><h2>The Deal</h2>The deck is divided evenly, with each player receiving 26 cards, dealt one at a time, face down. Anyone may deal first. Each player places his stack of cards face down, in front of him.<br><br><h2>The Play</h2>Each player turns up a card at the same time and the player with the higher card takes both cards and puts them, face down, on the bottom of his stack.<br><br><br>If the cards are the same rank, it is War. Each player turns up one card face down and one card face up. The player with the higher cards takes both piles (six cards). If the turned-up cards are again the same rank, each player places another card face down and turns another card face up. The player with the higher card takes all 10 cards, and so on.<br><br><h2>How to Keep Score</h2>The game ends when one player has earned 100 points.<br>"
  },{
    "name": "Black Jack",
    "endpoint": "blackJack",
    "type": "Card",
    "soloGame": false,
    "localMultiplayer": true,
    "iaAvailable": false,
    "icon": "black_jack_icon.png",
    "minPlayer": 2,
    "maxPlayer": 4,
    "totalPlayerIncludingAI": 5,
    "rule": "<strong>Blackjack</strong>,also known as <strong>twenty-one</strong>, is the most widely played casino banking game in the world. Blackjack is a comparing card game between a player and dealer, meaning players compete against the dealer but not against other players. It is played with one or more decks of 52 cards. The object of the game is to beat the dealer in one of the following ways:<br><ul><li>Get 21 points on the player's first two cards (called a \"blackjack\" or \"natural\"), without a dealer blackjack;</li><li>Reach a final score higher than the dealer without exceeding 21; or</li><li>Let the dealer draw additional cards until his or her hand exceeds 21.</li></ul>The player or players are dealt a two-card hand and add together the value of their cards. Face cards (kings, queens, and jacks) are counted as ten points. A player and the dealer can count an ace as 1 point or 11 points. All other cards are counted as the numeric value shown on the card. After receiving their first two cards, players have the option of getting a \"hit\", or taking an additional card. In a given round, the player or the dealer wins by having a score of 21 or by having the higher score that is less than 21. Scoring higher than 21 (called \"busting\" or \"going bust\") results in a loss. A player may win by having any final score equal to or less than 21 if the dealer busts. If a player holds an ace valued as 11, the hand is called \"soft\", meaning that the player cannot go bust by taking an additional card; 11 plus the value of any other card will always be less than or equal to 21. Otherwise, the hand is \"hard\".<br><br>The dealer must hit until the cards total 17 or more points. (At many tables the dealer also hits on a \"soft\" 17, i.e. a hand containing an ace and one or more other cards totaling six.) Players win by not busting and having a total higher than the dealer's. The dealer loses by busting or having a lesser hand than the player who has not busted. If the player and dealer have the same total, this is called a \"push\", and the player typically does not win or lose money on that hand."
  },{
    "name": "Yam's",
    "endpoint": "yams",
    "type": "Dice",
    "soloGame": true,
    "localMultiplayer": true,
    "iaAvailable": false,
    "icon": "yams-icon.png",
    "minPlayer": 2,
    "maxPlayer": 6,
    "totalPlayerIncludingAI": 6,
    "rule": "Each player throw the dices when it's his turn. The goal is to realize, with the five dices, a figure (5 dices identical, a pair, ...). To realize it, he can throw the dices three time each turn and he can choose which dice he throws.<br><br>The winner is the one who make the greater score, some figures giving additionnal points if they are done.<br><br>The score sheet is generally divided into two parts.<br><br><strong><u>Minor game</u></strong><br><br><ul><li><strong>Maximum of 1</strong>: Players must have the maximum of dice on face 1 / the score is : 1 x number of dices on 1</li><li><strong>Maximum of 2</strong>: Players must have the maximum of dice on face 2 / the score is : 2 x number of dices on 2</li><li><strong>Maximum of 3</strong>: Players must have the maximum of dice on face 3 / the score is : 3 x number of dices on 3</li><li><strong>Maximum of 4</strong>: Players must have the maximum of dice on face 4 / the score is : 4 x number of dices on 4</li><li><strong>Maximum of 5</strong>: Players must have the maximum of dice on face 5 / the score is : 5 x number of dices on 5</li><li><strong>Maximum of 6</strong>: Players must have the maximum of dice on face 6 / the score is : 6 x number of dices on 6</li></ul><br>They gain a bonus of 35 points if the total of minor game is greater than 63 points.<br><br><strong><u>Major game</u></strong><br><br><ul><li><strong>Three-Of-A-Kind</strong>: Players must have 3 dices of same value / they score 3 times the value of identical dices</li><li><strong>Four-Of-A-Kind</strong>: layers must have 4 dices of same value / they score 4 times the value of identical dices</li><li><strong>Full House</strong>: Player must have 3 identical dice AND 2 oher identical dices - (Three-Of-A-Kind + pair) / They score 25 points</li><li><strong>Small Straight</strong>: Players must have 4 dices in a row (1-2-3-4 / 2-3-4-5 / 3-4-5-6) / they score 30 points</li><li><strong>Large Straight</strong>: Players must have 5 dices in a row (1-2-3-4-5 / 2-3-4-5-6) / they score 40 points</li><li><strong>Yams</strong>: Players must have 5 identical dices / they score 50 points (A player can score maximum 2 Yam's)</li><li><strong>Chance</strong>: Players must have the maximum of points / they socre the sum of the dices' value</li><ul><br>Function of total points (including bonus) of minor game and major game, the winner is designated."
  }
]
